/*
 * @ : ***************************************************************************************
 * @Description: 
 * @version: 
 * @Author: liwei
 * @Date: 2019-10-28 08:47:32
 * @LastEditTime: 2019-10-31 11:11:45
 * @  : ***************************************************************************************
 */
/******************************************************************************************
** 头文件
*******************************************************************************************/
#include "../../inc/basic/basic_flash.h"

/********************************************************************************************
** 定义变量
********************************************************************************************/

	
/********************************************************************************************
** 函数申明
********************************************************************************************/
/********************************************************************************************
** 内容
********************************************************************************************/


/******************************************************************************************
** 函数名称：basic_my_read_filedata
** 函数描述：读取文件中指定位置的数据
** 输入参数：
** 返回值	：无
*******************************************************************************************/
uint8_t *basic_my_read_filedata(uint8_t *u8_data, uint8_t len, uint8_t offest )	//	
{
	int  i = 0,  fd = 0;

    fd = open("/opt/apu_fdata.txt", O_RDWR|O_CREAT);

	if(fd < 0)
	{ 
		 rt_kprintf("open file filedata read error!\n ");
	}

	i = lseek(fd, (offest * len), SEEK_SET);               //移动文件位置的偏移数，以字节为单位
	if(i < 0)
	{
		 rt_kprintf("flash seek failed!\n");
	}
	
	i = read(fd, u8_data, len);
	if (i < 0) 
	{ 
		 rt_kprintf("filedata read failed!\n ");
	} 
		
	close (fd);
	
	return u8_data;	
}

/********************************************************************************************
** 函数名称：	
** 函数描述：flash写数据接口
** 输入参数：len表示读取数据的长度，offest表示读取数据的位置
** 返回值  ：	 无
********************************************************************************************/
int basic_my_write_filedata(uint8_t *u8_data,  uint8_t len, uint8_t offest ) 
{
	int  i = 0,  fd = 0;

    fd = open("/opt/my_2g_store_fdata.txt", O_RDWR|O_CREAT);
	if (fd < 0)
	{ 
		 rt_kprintf("open file wirte filedate error!\n");
		 return -1;
	}
	
    for(i = 0; i < len; i++)                 //数据赋值
    {    
    	if(i % 20 ==0)	 //18的整数倍
		{
			if(i >= 0)  rt_kprintf("\n");
			rt_kprintf("filedate_wdata:");
		}
		 rt_kprintf(" %02x",u8_data[i]);
    }
	 rt_kprintf("\n");
   	   
	i = lseek(fd, (offest * len) , SEEK_SET); //移动文件位置的偏移数，以字节为单位
	if(i<0)
	{
		 rt_kprintf("filedate seek failed!\n");
		 return -1;
	}

	i = write(fd, u8_data, len);            //写数据
	if(i <0)  
	{
		 rt_kprintf("filedate write failed!\n");
		 return -1;
	}
	
	fsync(fd);
	close(fd);

	return 0;
}
