/*
 * @Description: 
 * @version: 
 * @Author: liwei
 * @Date: 2019-10-23 16:41:11
 * @LastEditTime: 2019-10-24 16:00:42
 */
/********************************************************************************************
头文件
********************************************************************************************/
#include "../../inc/thread/thread_uart_re_canopen.h"
/********************************************************************************************
宏定义
********************************************************************************************/
#define  RE_CANOPEN_THREAD_STACK_SZ        512         // 线程栈大小，单位是字节。
#define  RE_CANOPEN_THREAD_PRIO            20          // 优先级 范围是从 0 ～ 255，数值越小优先级越高，0 代表最高优先级
#define  RE_CANOPEN_THREAD_TIMESLICE       100         // 时间片大小：调用一次调度能够运行的最大时间长度
/********************************************************************************************
变量定义
********************************************************************************************/
static struct rt_thread re_canopen_thread;  
static rt_uint8_t re_canopen_thread_stack[RE_CANOPEN_THREAD_STACK_SZ];

/********************************************************************************************
函数申明
********************************************************************************************/

/*********************************************************************************************************
** 函数名称：
** 函数描述：接收canopen的显示线程入口
** 输入参数：数码管要显示的内容
** 返回值  ：无
*********************************************************************************************************/
static void re_canopen_thread_entry(void *param)
{

    while(1)
    {
        // bsp_uart_re_canopen_data( );
         rt_thread_mdelay(100);
    }

}
/********************************************************************************************
** 函数名称：     
** 函数描述：线程的初始化
** 输入参数：无
** 返回值  ：    无
********************************************************************************************/
int re_canopen_thread_init(void)
{ 
    
    //re_canopen_uart_input( );
    
    // .....................................静态线程初始化.......................................
    rt_thread_init( &re_canopen_thread,                                   // 线程结构体
                    "re_canopen",                                         // 线程名称
                    re_canopen_thread_entry, RT_NULL,                     // 线程入口函数名称和参数
                    re_canopen_thread_stack, RE_CANOPEN_THREAD_STACK_SZ,  // 栈的起始位置和大小 
                    RE_CANOPEN_THREAD_PRIO, RE_CANOPEN_THREAD_TIMESLICE); // 线程优先级，时间片大小
     //..................................... 启动线程 ，进入线程入口函数...........................
    rt_thread_startup(&re_canopen_thread);
	return  0;     
}
INIT_COMPONENT_EXPORT(re_canopen_thread_init);	

/********************************************************************************************
** 函数名称：     
** 函数描述：线程的初始化
** 输入参数：无
** 返回值  ：    无
********************************************************************************************/

rt_err_t  re_canopen_uart_input(void)
{  
    rt_err_t  result;

   // result = bsp_uart1_input(dev, size);

    return result;
}
/********************************************************************************************
** 函数名称：     
** 函数描述：线程的初始化
** 输入参数：无
** 返回值  ：    无
********************************************************************************************/
void uart_re_canopen_data(void)
{
   // bsp_uart_re_canopen_data(void)
}
