/*
 * @ : ***************************************************************************************
 * @Description: 
 * @version: 
 * @Author: liwei
 * @Date: 2019-10-30 09:00:07
 * @LastEditTime: 2019-10-31 14:17:00
 * @  : ***************************************************************************************
 */
#ifndef _HWTIMER_INTERRUPT_H_
#define _HWTIMER_INTERRUPT_H_

//..........................头文件.......................................
#include <rtthread.h>
#include <rtdevice.h>

        
//..........................函数申明.......................................
rt_err_t hwtimeout_cb(rt_device_t dev, rt_size_t size);

#endif

