/*
 * @ : ***************************************************************************************
 * @Description: 
 * @version: 
 * @Author: liwei
 * @Date: 2019-10-28 08:59:33
 * @LastEditTime: 2019-10-31 14:37:43
 * @  : ***************************************************************************************
 */

#ifndef _TIMER_INTERRUPT_H_
#define _TIMER_INTERRUPT_H_

//..........................头文件.......................................
#include <rtthread.h>

//..........................函数申明.......................................
extern void timeout1(void *parameter);
extern void timeout2(void *parameter);

#endif
